###################################################################

# Created by write_sdc on Tue Aug 15 15:41:56 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 0.05 [get_ports o_valid]
set_load -pin_load 0.05 [get_ports {o_data[95]}]
set_load -pin_load 0.05 [get_ports {o_data[94]}]
set_load -pin_load 0.05 [get_ports {o_data[93]}]
set_load -pin_load 0.05 [get_ports {o_data[92]}]
set_load -pin_load 0.05 [get_ports {o_data[91]}]
set_load -pin_load 0.05 [get_ports {o_data[90]}]
set_load -pin_load 0.05 [get_ports {o_data[89]}]
set_load -pin_load 0.05 [get_ports {o_data[88]}]
set_load -pin_load 0.05 [get_ports {o_data[87]}]
set_load -pin_load 0.05 [get_ports {o_data[86]}]
set_load -pin_load 0.05 [get_ports {o_data[85]}]
set_load -pin_load 0.05 [get_ports {o_data[84]}]
set_load -pin_load 0.05 [get_ports {o_data[83]}]
set_load -pin_load 0.05 [get_ports {o_data[82]}]
set_load -pin_load 0.05 [get_ports {o_data[81]}]
set_load -pin_load 0.05 [get_ports {o_data[80]}]
set_load -pin_load 0.05 [get_ports {o_data[79]}]
set_load -pin_load 0.05 [get_ports {o_data[78]}]
set_load -pin_load 0.05 [get_ports {o_data[77]}]
set_load -pin_load 0.05 [get_ports {o_data[76]}]
set_load -pin_load 0.05 [get_ports {o_data[75]}]
set_load -pin_load 0.05 [get_ports {o_data[74]}]
set_load -pin_load 0.05 [get_ports {o_data[73]}]
set_load -pin_load 0.05 [get_ports {o_data[72]}]
set_load -pin_load 0.05 [get_ports {o_data[71]}]
set_load -pin_load 0.05 [get_ports {o_data[70]}]
set_load -pin_load 0.05 [get_ports {o_data[69]}]
set_load -pin_load 0.05 [get_ports {o_data[68]}]
set_load -pin_load 0.05 [get_ports {o_data[67]}]
set_load -pin_load 0.05 [get_ports {o_data[66]}]
set_load -pin_load 0.05 [get_ports {o_data[65]}]
set_load -pin_load 0.05 [get_ports {o_data[64]}]
set_load -pin_load 0.05 [get_ports {o_data[63]}]
set_load -pin_load 0.05 [get_ports {o_data[62]}]
set_load -pin_load 0.05 [get_ports {o_data[61]}]
set_load -pin_load 0.05 [get_ports {o_data[60]}]
set_load -pin_load 0.05 [get_ports {o_data[59]}]
set_load -pin_load 0.05 [get_ports {o_data[58]}]
set_load -pin_load 0.05 [get_ports {o_data[57]}]
set_load -pin_load 0.05 [get_ports {o_data[56]}]
set_load -pin_load 0.05 [get_ports {o_data[55]}]
set_load -pin_load 0.05 [get_ports {o_data[54]}]
set_load -pin_load 0.05 [get_ports {o_data[53]}]
set_load -pin_load 0.05 [get_ports {o_data[52]}]
set_load -pin_load 0.05 [get_ports {o_data[51]}]
set_load -pin_load 0.05 [get_ports {o_data[50]}]
set_load -pin_load 0.05 [get_ports {o_data[49]}]
set_load -pin_load 0.05 [get_ports {o_data[48]}]
set_load -pin_load 0.05 [get_ports {o_data[47]}]
set_load -pin_load 0.05 [get_ports {o_data[46]}]
set_load -pin_load 0.05 [get_ports {o_data[45]}]
set_load -pin_load 0.05 [get_ports {o_data[44]}]
set_load -pin_load 0.05 [get_ports {o_data[43]}]
set_load -pin_load 0.05 [get_ports {o_data[42]}]
set_load -pin_load 0.05 [get_ports {o_data[41]}]
set_load -pin_load 0.05 [get_ports {o_data[40]}]
set_load -pin_load 0.05 [get_ports {o_data[39]}]
set_load -pin_load 0.05 [get_ports {o_data[38]}]
set_load -pin_load 0.05 [get_ports {o_data[37]}]
set_load -pin_load 0.05 [get_ports {o_data[36]}]
set_load -pin_load 0.05 [get_ports {o_data[35]}]
set_load -pin_load 0.05 [get_ports {o_data[34]}]
set_load -pin_load 0.05 [get_ports {o_data[33]}]
set_load -pin_load 0.05 [get_ports {o_data[32]}]
set_load -pin_load 0.05 [get_ports {o_data[31]}]
set_load -pin_load 0.05 [get_ports {o_data[30]}]
set_load -pin_load 0.05 [get_ports {o_data[29]}]
set_load -pin_load 0.05 [get_ports {o_data[28]}]
set_load -pin_load 0.05 [get_ports {o_data[27]}]
set_load -pin_load 0.05 [get_ports {o_data[26]}]
set_load -pin_load 0.05 [get_ports {o_data[25]}]
set_load -pin_load 0.05 [get_ports {o_data[24]}]
set_load -pin_load 0.05 [get_ports {o_data[23]}]
set_load -pin_load 0.05 [get_ports {o_data[22]}]
set_load -pin_load 0.05 [get_ports {o_data[21]}]
set_load -pin_load 0.05 [get_ports {o_data[20]}]
set_load -pin_load 0.05 [get_ports {o_data[19]}]
set_load -pin_load 0.05 [get_ports {o_data[18]}]
set_load -pin_load 0.05 [get_ports {o_data[17]}]
set_load -pin_load 0.05 [get_ports {o_data[16]}]
set_load -pin_load 0.05 [get_ports {o_data[15]}]
set_load -pin_load 0.05 [get_ports {o_data[14]}]
set_load -pin_load 0.05 [get_ports {o_data[13]}]
set_load -pin_load 0.05 [get_ports {o_data[12]}]
set_load -pin_load 0.05 [get_ports {o_data[11]}]
set_load -pin_load 0.05 [get_ports {o_data[10]}]
set_load -pin_load 0.05 [get_ports {o_data[9]}]
set_load -pin_load 0.05 [get_ports {o_data[8]}]
set_load -pin_load 0.05 [get_ports {o_data[7]}]
set_load -pin_load 0.05 [get_ports {o_data[6]}]
set_load -pin_load 0.05 [get_ports {o_data[5]}]
set_load -pin_load 0.05 [get_ports {o_data[4]}]
set_load -pin_load 0.05 [get_ports {o_data[3]}]
set_load -pin_load 0.05 [get_ports {o_data[2]}]
set_load -pin_load 0.05 [get_ports {o_data[1]}]
set_load -pin_load 0.05 [get_ports {o_data[0]}]
set_ideal_network -no_propagate  [get_ports clk]
create_clock [get_ports clk]  -period 2.6  -waveform {0 1.3}
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  1  [get_ports rst_n]
set_input_delay -clock clk  1  [get_ports i_hs]
set_input_delay -clock clk  1  [get_ports i_vs]
set_input_delay -clock clk  1  [get_ports i_de]
set_input_delay -clock clk  1  [get_ports i_spr_sharp_en]
set_input_delay -clock clk  1  [get_ports i_spr_sharp_prt]
set_input_delay -clock clk  1  [get_ports i_spr_seperate_case]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[12]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[11]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[10]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[9]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[8]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[7]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[6]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[5]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[4]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[3]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[2]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[1]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_hi[0]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[12]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[11]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[10]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[9]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[8]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[7]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[6]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[5]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[4]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[3]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[2]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[1]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_lo[0]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[11]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[10]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[9]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[8]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[7]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[6]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[5]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[4]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[3]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[2]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[1]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_r[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_r[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_r[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_r[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_r[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_r[0]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[11]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[10]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[9]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[8]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[7]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[6]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[5]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[4]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[3]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[2]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[1]}]
set_input_delay -clock clk  1  [get_ports {i_spr_thr_edge_b[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue2_edge_b[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue3_edge_b[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue4_edge_b[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue5_edge_b[0]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[13]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[12]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[11]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[10]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[9]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[8]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[7]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[6]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[5]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[4]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[3]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[2]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[1]}]
set_input_delay -clock clk  1  [get_ports {i_pValue_border_b[0]}]
set_input_delay -clock clk  1  [get_ports {i_data[119]}]
set_input_delay -clock clk  1  [get_ports {i_data[118]}]
set_input_delay -clock clk  1  [get_ports {i_data[117]}]
set_input_delay -clock clk  1  [get_ports {i_data[116]}]
set_input_delay -clock clk  1  [get_ports {i_data[115]}]
set_input_delay -clock clk  1  [get_ports {i_data[114]}]
set_input_delay -clock clk  1  [get_ports {i_data[113]}]
set_input_delay -clock clk  1  [get_ports {i_data[112]}]
set_input_delay -clock clk  1  [get_ports {i_data[111]}]
set_input_delay -clock clk  1  [get_ports {i_data[110]}]
set_input_delay -clock clk  1  [get_ports {i_data[109]}]
set_input_delay -clock clk  1  [get_ports {i_data[108]}]
set_input_delay -clock clk  1  [get_ports {i_data[107]}]
set_input_delay -clock clk  1  [get_ports {i_data[106]}]
set_input_delay -clock clk  1  [get_ports {i_data[105]}]
set_input_delay -clock clk  1  [get_ports {i_data[104]}]
set_input_delay -clock clk  1  [get_ports {i_data[103]}]
set_input_delay -clock clk  1  [get_ports {i_data[102]}]
set_input_delay -clock clk  1  [get_ports {i_data[101]}]
set_input_delay -clock clk  1  [get_ports {i_data[100]}]
set_input_delay -clock clk  1  [get_ports {i_data[99]}]
set_input_delay -clock clk  1  [get_ports {i_data[98]}]
set_input_delay -clock clk  1  [get_ports {i_data[97]}]
set_input_delay -clock clk  1  [get_ports {i_data[96]}]
set_input_delay -clock clk  1  [get_ports {i_data[95]}]
set_input_delay -clock clk  1  [get_ports {i_data[94]}]
set_input_delay -clock clk  1  [get_ports {i_data[93]}]
set_input_delay -clock clk  1  [get_ports {i_data[92]}]
set_input_delay -clock clk  1  [get_ports {i_data[91]}]
set_input_delay -clock clk  1  [get_ports {i_data[90]}]
set_input_delay -clock clk  1  [get_ports {i_data[89]}]
set_input_delay -clock clk  1  [get_ports {i_data[88]}]
set_input_delay -clock clk  1  [get_ports {i_data[87]}]
set_input_delay -clock clk  1  [get_ports {i_data[86]}]
set_input_delay -clock clk  1  [get_ports {i_data[85]}]
set_input_delay -clock clk  1  [get_ports {i_data[84]}]
set_input_delay -clock clk  1  [get_ports {i_data[83]}]
set_input_delay -clock clk  1  [get_ports {i_data[82]}]
set_input_delay -clock clk  1  [get_ports {i_data[81]}]
set_input_delay -clock clk  1  [get_ports {i_data[80]}]
set_input_delay -clock clk  1  [get_ports {i_data[79]}]
set_input_delay -clock clk  1  [get_ports {i_data[78]}]
set_input_delay -clock clk  1  [get_ports {i_data[77]}]
set_input_delay -clock clk  1  [get_ports {i_data[76]}]
set_input_delay -clock clk  1  [get_ports {i_data[75]}]
set_input_delay -clock clk  1  [get_ports {i_data[74]}]
set_input_delay -clock clk  1  [get_ports {i_data[73]}]
set_input_delay -clock clk  1  [get_ports {i_data[72]}]
set_input_delay -clock clk  1  [get_ports {i_data[71]}]
set_input_delay -clock clk  1  [get_ports {i_data[70]}]
set_input_delay -clock clk  1  [get_ports {i_data[69]}]
set_input_delay -clock clk  1  [get_ports {i_data[68]}]
set_input_delay -clock clk  1  [get_ports {i_data[67]}]
set_input_delay -clock clk  1  [get_ports {i_data[66]}]
set_input_delay -clock clk  1  [get_ports {i_data[65]}]
set_input_delay -clock clk  1  [get_ports {i_data[64]}]
set_input_delay -clock clk  1  [get_ports {i_data[63]}]
set_input_delay -clock clk  1  [get_ports {i_data[62]}]
set_input_delay -clock clk  1  [get_ports {i_data[61]}]
set_input_delay -clock clk  1  [get_ports {i_data[60]}]
set_input_delay -clock clk  1  [get_ports {i_data[59]}]
set_input_delay -clock clk  1  [get_ports {i_data[58]}]
set_input_delay -clock clk  1  [get_ports {i_data[57]}]
set_input_delay -clock clk  1  [get_ports {i_data[56]}]
set_input_delay -clock clk  1  [get_ports {i_data[55]}]
set_input_delay -clock clk  1  [get_ports {i_data[54]}]
set_input_delay -clock clk  1  [get_ports {i_data[53]}]
set_input_delay -clock clk  1  [get_ports {i_data[52]}]
set_input_delay -clock clk  1  [get_ports {i_data[51]}]
set_input_delay -clock clk  1  [get_ports {i_data[50]}]
set_input_delay -clock clk  1  [get_ports {i_data[49]}]
set_input_delay -clock clk  1  [get_ports {i_data[48]}]
set_input_delay -clock clk  1  [get_ports {i_data[47]}]
set_input_delay -clock clk  1  [get_ports {i_data[46]}]
set_input_delay -clock clk  1  [get_ports {i_data[45]}]
set_input_delay -clock clk  1  [get_ports {i_data[44]}]
set_input_delay -clock clk  1  [get_ports {i_data[43]}]
set_input_delay -clock clk  1  [get_ports {i_data[42]}]
set_input_delay -clock clk  1  [get_ports {i_data[41]}]
set_input_delay -clock clk  1  [get_ports {i_data[40]}]
set_input_delay -clock clk  1  [get_ports {i_data[39]}]
set_input_delay -clock clk  1  [get_ports {i_data[38]}]
set_input_delay -clock clk  1  [get_ports {i_data[37]}]
set_input_delay -clock clk  1  [get_ports {i_data[36]}]
set_input_delay -clock clk  1  [get_ports {i_data[35]}]
set_input_delay -clock clk  1  [get_ports {i_data[34]}]
set_input_delay -clock clk  1  [get_ports {i_data[33]}]
set_input_delay -clock clk  1  [get_ports {i_data[32]}]
set_input_delay -clock clk  1  [get_ports {i_data[31]}]
set_input_delay -clock clk  1  [get_ports {i_data[30]}]
set_input_delay -clock clk  1  [get_ports {i_data[29]}]
set_input_delay -clock clk  1  [get_ports {i_data[28]}]
set_input_delay -clock clk  1  [get_ports {i_data[27]}]
set_input_delay -clock clk  1  [get_ports {i_data[26]}]
set_input_delay -clock clk  1  [get_ports {i_data[25]}]
set_input_delay -clock clk  1  [get_ports {i_data[24]}]
set_input_delay -clock clk  1  [get_ports {i_data[23]}]
set_input_delay -clock clk  1  [get_ports {i_data[22]}]
set_input_delay -clock clk  1  [get_ports {i_data[21]}]
set_input_delay -clock clk  1  [get_ports {i_data[20]}]
set_input_delay -clock clk  1  [get_ports {i_data[19]}]
set_input_delay -clock clk  1  [get_ports {i_data[18]}]
set_input_delay -clock clk  1  [get_ports {i_data[17]}]
set_input_delay -clock clk  1  [get_ports {i_data[16]}]
set_input_delay -clock clk  1  [get_ports {i_data[15]}]
set_input_delay -clock clk  1  [get_ports {i_data[14]}]
set_input_delay -clock clk  1  [get_ports {i_data[13]}]
set_input_delay -clock clk  1  [get_ports {i_data[12]}]
set_input_delay -clock clk  1  [get_ports {i_data[11]}]
set_input_delay -clock clk  1  [get_ports {i_data[10]}]
set_input_delay -clock clk  1  [get_ports {i_data[9]}]
set_input_delay -clock clk  1  [get_ports {i_data[8]}]
set_input_delay -clock clk  1  [get_ports {i_data[7]}]
set_input_delay -clock clk  1  [get_ports {i_data[6]}]
set_input_delay -clock clk  1  [get_ports {i_data[5]}]
set_input_delay -clock clk  1  [get_ports {i_data[4]}]
set_input_delay -clock clk  1  [get_ports {i_data[3]}]
set_input_delay -clock clk  1  [get_ports {i_data[2]}]
set_input_delay -clock clk  1  [get_ports {i_data[1]}]
set_input_delay -clock clk  1  [get_ports {i_data[0]}]
set_output_delay -clock clk  1  [get_ports o_valid]
set_output_delay -clock clk  1  [get_ports {o_data[95]}]
set_output_delay -clock clk  1  [get_ports {o_data[94]}]
set_output_delay -clock clk  1  [get_ports {o_data[93]}]
set_output_delay -clock clk  1  [get_ports {o_data[92]}]
set_output_delay -clock clk  1  [get_ports {o_data[91]}]
set_output_delay -clock clk  1  [get_ports {o_data[90]}]
set_output_delay -clock clk  1  [get_ports {o_data[89]}]
set_output_delay -clock clk  1  [get_ports {o_data[88]}]
set_output_delay -clock clk  1  [get_ports {o_data[87]}]
set_output_delay -clock clk  1  [get_ports {o_data[86]}]
set_output_delay -clock clk  1  [get_ports {o_data[85]}]
set_output_delay -clock clk  1  [get_ports {o_data[84]}]
set_output_delay -clock clk  1  [get_ports {o_data[83]}]
set_output_delay -clock clk  1  [get_ports {o_data[82]}]
set_output_delay -clock clk  1  [get_ports {o_data[81]}]
set_output_delay -clock clk  1  [get_ports {o_data[80]}]
set_output_delay -clock clk  1  [get_ports {o_data[79]}]
set_output_delay -clock clk  1  [get_ports {o_data[78]}]
set_output_delay -clock clk  1  [get_ports {o_data[77]}]
set_output_delay -clock clk  1  [get_ports {o_data[76]}]
set_output_delay -clock clk  1  [get_ports {o_data[75]}]
set_output_delay -clock clk  1  [get_ports {o_data[74]}]
set_output_delay -clock clk  1  [get_ports {o_data[73]}]
set_output_delay -clock clk  1  [get_ports {o_data[72]}]
set_output_delay -clock clk  1  [get_ports {o_data[71]}]
set_output_delay -clock clk  1  [get_ports {o_data[70]}]
set_output_delay -clock clk  1  [get_ports {o_data[69]}]
set_output_delay -clock clk  1  [get_ports {o_data[68]}]
set_output_delay -clock clk  1  [get_ports {o_data[67]}]
set_output_delay -clock clk  1  [get_ports {o_data[66]}]
set_output_delay -clock clk  1  [get_ports {o_data[65]}]
set_output_delay -clock clk  1  [get_ports {o_data[64]}]
set_output_delay -clock clk  1  [get_ports {o_data[63]}]
set_output_delay -clock clk  1  [get_ports {o_data[62]}]
set_output_delay -clock clk  1  [get_ports {o_data[61]}]
set_output_delay -clock clk  1  [get_ports {o_data[60]}]
set_output_delay -clock clk  1  [get_ports {o_data[59]}]
set_output_delay -clock clk  1  [get_ports {o_data[58]}]
set_output_delay -clock clk  1  [get_ports {o_data[57]}]
set_output_delay -clock clk  1  [get_ports {o_data[56]}]
set_output_delay -clock clk  1  [get_ports {o_data[55]}]
set_output_delay -clock clk  1  [get_ports {o_data[54]}]
set_output_delay -clock clk  1  [get_ports {o_data[53]}]
set_output_delay -clock clk  1  [get_ports {o_data[52]}]
set_output_delay -clock clk  1  [get_ports {o_data[51]}]
set_output_delay -clock clk  1  [get_ports {o_data[50]}]
set_output_delay -clock clk  1  [get_ports {o_data[49]}]
set_output_delay -clock clk  1  [get_ports {o_data[48]}]
set_output_delay -clock clk  1  [get_ports {o_data[47]}]
set_output_delay -clock clk  1  [get_ports {o_data[46]}]
set_output_delay -clock clk  1  [get_ports {o_data[45]}]
set_output_delay -clock clk  1  [get_ports {o_data[44]}]
set_output_delay -clock clk  1  [get_ports {o_data[43]}]
set_output_delay -clock clk  1  [get_ports {o_data[42]}]
set_output_delay -clock clk  1  [get_ports {o_data[41]}]
set_output_delay -clock clk  1  [get_ports {o_data[40]}]
set_output_delay -clock clk  1  [get_ports {o_data[39]}]
set_output_delay -clock clk  1  [get_ports {o_data[38]}]
set_output_delay -clock clk  1  [get_ports {o_data[37]}]
set_output_delay -clock clk  1  [get_ports {o_data[36]}]
set_output_delay -clock clk  1  [get_ports {o_data[35]}]
set_output_delay -clock clk  1  [get_ports {o_data[34]}]
set_output_delay -clock clk  1  [get_ports {o_data[33]}]
set_output_delay -clock clk  1  [get_ports {o_data[32]}]
set_output_delay -clock clk  1  [get_ports {o_data[31]}]
set_output_delay -clock clk  1  [get_ports {o_data[30]}]
set_output_delay -clock clk  1  [get_ports {o_data[29]}]
set_output_delay -clock clk  1  [get_ports {o_data[28]}]
set_output_delay -clock clk  1  [get_ports {o_data[27]}]
set_output_delay -clock clk  1  [get_ports {o_data[26]}]
set_output_delay -clock clk  1  [get_ports {o_data[25]}]
set_output_delay -clock clk  1  [get_ports {o_data[24]}]
set_output_delay -clock clk  1  [get_ports {o_data[23]}]
set_output_delay -clock clk  1  [get_ports {o_data[22]}]
set_output_delay -clock clk  1  [get_ports {o_data[21]}]
set_output_delay -clock clk  1  [get_ports {o_data[20]}]
set_output_delay -clock clk  1  [get_ports {o_data[19]}]
set_output_delay -clock clk  1  [get_ports {o_data[18]}]
set_output_delay -clock clk  1  [get_ports {o_data[17]}]
set_output_delay -clock clk  1  [get_ports {o_data[16]}]
set_output_delay -clock clk  1  [get_ports {o_data[15]}]
set_output_delay -clock clk  1  [get_ports {o_data[14]}]
set_output_delay -clock clk  1  [get_ports {o_data[13]}]
set_output_delay -clock clk  1  [get_ports {o_data[12]}]
set_output_delay -clock clk  1  [get_ports {o_data[11]}]
set_output_delay -clock clk  1  [get_ports {o_data[10]}]
set_output_delay -clock clk  1  [get_ports {o_data[9]}]
set_output_delay -clock clk  1  [get_ports {o_data[8]}]
set_output_delay -clock clk  1  [get_ports {o_data[7]}]
set_output_delay -clock clk  1  [get_ports {o_data[6]}]
set_output_delay -clock clk  1  [get_ports {o_data[5]}]
set_output_delay -clock clk  1  [get_ports {o_data[4]}]
set_output_delay -clock clk  1  [get_ports {o_data[3]}]
set_output_delay -clock clk  1  [get_ports {o_data[2]}]
set_output_delay -clock clk  1  [get_ports {o_data[1]}]
set_output_delay -clock clk  1  [get_ports {o_data[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rst_n]
set_drive 1  [get_ports i_hs]
set_drive 1  [get_ports i_vs]
set_drive 1  [get_ports i_de]
set_drive 1  [get_ports i_spr_sharp_en]
set_drive 1  [get_ports i_spr_sharp_prt]
set_drive 1  [get_ports i_spr_seperate_case]
set_drive 1  [get_ports {i_spr_thr_hi[12]}]
set_drive 1  [get_ports {i_spr_thr_hi[11]}]
set_drive 1  [get_ports {i_spr_thr_hi[10]}]
set_drive 1  [get_ports {i_spr_thr_hi[9]}]
set_drive 1  [get_ports {i_spr_thr_hi[8]}]
set_drive 1  [get_ports {i_spr_thr_hi[7]}]
set_drive 1  [get_ports {i_spr_thr_hi[6]}]
set_drive 1  [get_ports {i_spr_thr_hi[5]}]
set_drive 1  [get_ports {i_spr_thr_hi[4]}]
set_drive 1  [get_ports {i_spr_thr_hi[3]}]
set_drive 1  [get_ports {i_spr_thr_hi[2]}]
set_drive 1  [get_ports {i_spr_thr_hi[1]}]
set_drive 1  [get_ports {i_spr_thr_hi[0]}]
set_drive 1  [get_ports {i_spr_thr_lo[12]}]
set_drive 1  [get_ports {i_spr_thr_lo[11]}]
set_drive 1  [get_ports {i_spr_thr_lo[10]}]
set_drive 1  [get_ports {i_spr_thr_lo[9]}]
set_drive 1  [get_ports {i_spr_thr_lo[8]}]
set_drive 1  [get_ports {i_spr_thr_lo[7]}]
set_drive 1  [get_ports {i_spr_thr_lo[6]}]
set_drive 1  [get_ports {i_spr_thr_lo[5]}]
set_drive 1  [get_ports {i_spr_thr_lo[4]}]
set_drive 1  [get_ports {i_spr_thr_lo[3]}]
set_drive 1  [get_ports {i_spr_thr_lo[2]}]
set_drive 1  [get_ports {i_spr_thr_lo[1]}]
set_drive 1  [get_ports {i_spr_thr_lo[0]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[11]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[10]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[9]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[8]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[7]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[6]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[5]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[4]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[3]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[2]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[1]}]
set_drive 1  [get_ports {i_spr_thr_edge_r[0]}]
set_drive 1  [get_ports {i_pValue2_edge_r[13]}]
set_drive 1  [get_ports {i_pValue2_edge_r[12]}]
set_drive 1  [get_ports {i_pValue2_edge_r[11]}]
set_drive 1  [get_ports {i_pValue2_edge_r[10]}]
set_drive 1  [get_ports {i_pValue2_edge_r[9]}]
set_drive 1  [get_ports {i_pValue2_edge_r[8]}]
set_drive 1  [get_ports {i_pValue2_edge_r[7]}]
set_drive 1  [get_ports {i_pValue2_edge_r[6]}]
set_drive 1  [get_ports {i_pValue2_edge_r[5]}]
set_drive 1  [get_ports {i_pValue2_edge_r[4]}]
set_drive 1  [get_ports {i_pValue2_edge_r[3]}]
set_drive 1  [get_ports {i_pValue2_edge_r[2]}]
set_drive 1  [get_ports {i_pValue2_edge_r[1]}]
set_drive 1  [get_ports {i_pValue2_edge_r[0]}]
set_drive 1  [get_ports {i_pValue3_edge_r[13]}]
set_drive 1  [get_ports {i_pValue3_edge_r[12]}]
set_drive 1  [get_ports {i_pValue3_edge_r[11]}]
set_drive 1  [get_ports {i_pValue3_edge_r[10]}]
set_drive 1  [get_ports {i_pValue3_edge_r[9]}]
set_drive 1  [get_ports {i_pValue3_edge_r[8]}]
set_drive 1  [get_ports {i_pValue3_edge_r[7]}]
set_drive 1  [get_ports {i_pValue3_edge_r[6]}]
set_drive 1  [get_ports {i_pValue3_edge_r[5]}]
set_drive 1  [get_ports {i_pValue3_edge_r[4]}]
set_drive 1  [get_ports {i_pValue3_edge_r[3]}]
set_drive 1  [get_ports {i_pValue3_edge_r[2]}]
set_drive 1  [get_ports {i_pValue3_edge_r[1]}]
set_drive 1  [get_ports {i_pValue3_edge_r[0]}]
set_drive 1  [get_ports {i_pValue4_edge_r[13]}]
set_drive 1  [get_ports {i_pValue4_edge_r[12]}]
set_drive 1  [get_ports {i_pValue4_edge_r[11]}]
set_drive 1  [get_ports {i_pValue4_edge_r[10]}]
set_drive 1  [get_ports {i_pValue4_edge_r[9]}]
set_drive 1  [get_ports {i_pValue4_edge_r[8]}]
set_drive 1  [get_ports {i_pValue4_edge_r[7]}]
set_drive 1  [get_ports {i_pValue4_edge_r[6]}]
set_drive 1  [get_ports {i_pValue4_edge_r[5]}]
set_drive 1  [get_ports {i_pValue4_edge_r[4]}]
set_drive 1  [get_ports {i_pValue4_edge_r[3]}]
set_drive 1  [get_ports {i_pValue4_edge_r[2]}]
set_drive 1  [get_ports {i_pValue4_edge_r[1]}]
set_drive 1  [get_ports {i_pValue4_edge_r[0]}]
set_drive 1  [get_ports {i_pValue5_edge_r[13]}]
set_drive 1  [get_ports {i_pValue5_edge_r[12]}]
set_drive 1  [get_ports {i_pValue5_edge_r[11]}]
set_drive 1  [get_ports {i_pValue5_edge_r[10]}]
set_drive 1  [get_ports {i_pValue5_edge_r[9]}]
set_drive 1  [get_ports {i_pValue5_edge_r[8]}]
set_drive 1  [get_ports {i_pValue5_edge_r[7]}]
set_drive 1  [get_ports {i_pValue5_edge_r[6]}]
set_drive 1  [get_ports {i_pValue5_edge_r[5]}]
set_drive 1  [get_ports {i_pValue5_edge_r[4]}]
set_drive 1  [get_ports {i_pValue5_edge_r[3]}]
set_drive 1  [get_ports {i_pValue5_edge_r[2]}]
set_drive 1  [get_ports {i_pValue5_edge_r[1]}]
set_drive 1  [get_ports {i_pValue5_edge_r[0]}]
set_drive 1  [get_ports {i_pValue_border_r[13]}]
set_drive 1  [get_ports {i_pValue_border_r[12]}]
set_drive 1  [get_ports {i_pValue_border_r[11]}]
set_drive 1  [get_ports {i_pValue_border_r[10]}]
set_drive 1  [get_ports {i_pValue_border_r[9]}]
set_drive 1  [get_ports {i_pValue_border_r[8]}]
set_drive 1  [get_ports {i_pValue_border_r[7]}]
set_drive 1  [get_ports {i_pValue_border_r[6]}]
set_drive 1  [get_ports {i_pValue_border_r[5]}]
set_drive 1  [get_ports {i_pValue_border_r[4]}]
set_drive 1  [get_ports {i_pValue_border_r[3]}]
set_drive 1  [get_ports {i_pValue_border_r[2]}]
set_drive 1  [get_ports {i_pValue_border_r[1]}]
set_drive 1  [get_ports {i_pValue_border_r[0]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[11]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[10]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[9]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[8]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[7]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[6]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[5]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[4]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[3]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[2]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[1]}]
set_drive 1  [get_ports {i_spr_thr_edge_b[0]}]
set_drive 1  [get_ports {i_pValue2_edge_b[13]}]
set_drive 1  [get_ports {i_pValue2_edge_b[12]}]
set_drive 1  [get_ports {i_pValue2_edge_b[11]}]
set_drive 1  [get_ports {i_pValue2_edge_b[10]}]
set_drive 1  [get_ports {i_pValue2_edge_b[9]}]
set_drive 1  [get_ports {i_pValue2_edge_b[8]}]
set_drive 1  [get_ports {i_pValue2_edge_b[7]}]
set_drive 1  [get_ports {i_pValue2_edge_b[6]}]
set_drive 1  [get_ports {i_pValue2_edge_b[5]}]
set_drive 1  [get_ports {i_pValue2_edge_b[4]}]
set_drive 1  [get_ports {i_pValue2_edge_b[3]}]
set_drive 1  [get_ports {i_pValue2_edge_b[2]}]
set_drive 1  [get_ports {i_pValue2_edge_b[1]}]
set_drive 1  [get_ports {i_pValue2_edge_b[0]}]
set_drive 1  [get_ports {i_pValue3_edge_b[13]}]
set_drive 1  [get_ports {i_pValue3_edge_b[12]}]
set_drive 1  [get_ports {i_pValue3_edge_b[11]}]
set_drive 1  [get_ports {i_pValue3_edge_b[10]}]
set_drive 1  [get_ports {i_pValue3_edge_b[9]}]
set_drive 1  [get_ports {i_pValue3_edge_b[8]}]
set_drive 1  [get_ports {i_pValue3_edge_b[7]}]
set_drive 1  [get_ports {i_pValue3_edge_b[6]}]
set_drive 1  [get_ports {i_pValue3_edge_b[5]}]
set_drive 1  [get_ports {i_pValue3_edge_b[4]}]
set_drive 1  [get_ports {i_pValue3_edge_b[3]}]
set_drive 1  [get_ports {i_pValue3_edge_b[2]}]
set_drive 1  [get_ports {i_pValue3_edge_b[1]}]
set_drive 1  [get_ports {i_pValue3_edge_b[0]}]
set_drive 1  [get_ports {i_pValue4_edge_b[13]}]
set_drive 1  [get_ports {i_pValue4_edge_b[12]}]
set_drive 1  [get_ports {i_pValue4_edge_b[11]}]
set_drive 1  [get_ports {i_pValue4_edge_b[10]}]
set_drive 1  [get_ports {i_pValue4_edge_b[9]}]
set_drive 1  [get_ports {i_pValue4_edge_b[8]}]
set_drive 1  [get_ports {i_pValue4_edge_b[7]}]
set_drive 1  [get_ports {i_pValue4_edge_b[6]}]
set_drive 1  [get_ports {i_pValue4_edge_b[5]}]
set_drive 1  [get_ports {i_pValue4_edge_b[4]}]
set_drive 1  [get_ports {i_pValue4_edge_b[3]}]
set_drive 1  [get_ports {i_pValue4_edge_b[2]}]
set_drive 1  [get_ports {i_pValue4_edge_b[1]}]
set_drive 1  [get_ports {i_pValue4_edge_b[0]}]
set_drive 1  [get_ports {i_pValue5_edge_b[13]}]
set_drive 1  [get_ports {i_pValue5_edge_b[12]}]
set_drive 1  [get_ports {i_pValue5_edge_b[11]}]
set_drive 1  [get_ports {i_pValue5_edge_b[10]}]
set_drive 1  [get_ports {i_pValue5_edge_b[9]}]
set_drive 1  [get_ports {i_pValue5_edge_b[8]}]
set_drive 1  [get_ports {i_pValue5_edge_b[7]}]
set_drive 1  [get_ports {i_pValue5_edge_b[6]}]
set_drive 1  [get_ports {i_pValue5_edge_b[5]}]
set_drive 1  [get_ports {i_pValue5_edge_b[4]}]
set_drive 1  [get_ports {i_pValue5_edge_b[3]}]
set_drive 1  [get_ports {i_pValue5_edge_b[2]}]
set_drive 1  [get_ports {i_pValue5_edge_b[1]}]
set_drive 1  [get_ports {i_pValue5_edge_b[0]}]
set_drive 1  [get_ports {i_pValue_border_b[13]}]
set_drive 1  [get_ports {i_pValue_border_b[12]}]
set_drive 1  [get_ports {i_pValue_border_b[11]}]
set_drive 1  [get_ports {i_pValue_border_b[10]}]
set_drive 1  [get_ports {i_pValue_border_b[9]}]
set_drive 1  [get_ports {i_pValue_border_b[8]}]
set_drive 1  [get_ports {i_pValue_border_b[7]}]
set_drive 1  [get_ports {i_pValue_border_b[6]}]
set_drive 1  [get_ports {i_pValue_border_b[5]}]
set_drive 1  [get_ports {i_pValue_border_b[4]}]
set_drive 1  [get_ports {i_pValue_border_b[3]}]
set_drive 1  [get_ports {i_pValue_border_b[2]}]
set_drive 1  [get_ports {i_pValue_border_b[1]}]
set_drive 1  [get_ports {i_pValue_border_b[0]}]
set_drive 1  [get_ports {i_data[119]}]
set_drive 1  [get_ports {i_data[118]}]
set_drive 1  [get_ports {i_data[117]}]
set_drive 1  [get_ports {i_data[116]}]
set_drive 1  [get_ports {i_data[115]}]
set_drive 1  [get_ports {i_data[114]}]
set_drive 1  [get_ports {i_data[113]}]
set_drive 1  [get_ports {i_data[112]}]
set_drive 1  [get_ports {i_data[111]}]
set_drive 1  [get_ports {i_data[110]}]
set_drive 1  [get_ports {i_data[109]}]
set_drive 1  [get_ports {i_data[108]}]
set_drive 1  [get_ports {i_data[107]}]
set_drive 1  [get_ports {i_data[106]}]
set_drive 1  [get_ports {i_data[105]}]
set_drive 1  [get_ports {i_data[104]}]
set_drive 1  [get_ports {i_data[103]}]
set_drive 1  [get_ports {i_data[102]}]
set_drive 1  [get_ports {i_data[101]}]
set_drive 1  [get_ports {i_data[100]}]
set_drive 1  [get_ports {i_data[99]}]
set_drive 1  [get_ports {i_data[98]}]
set_drive 1  [get_ports {i_data[97]}]
set_drive 1  [get_ports {i_data[96]}]
set_drive 1  [get_ports {i_data[95]}]
set_drive 1  [get_ports {i_data[94]}]
set_drive 1  [get_ports {i_data[93]}]
set_drive 1  [get_ports {i_data[92]}]
set_drive 1  [get_ports {i_data[91]}]
set_drive 1  [get_ports {i_data[90]}]
set_drive 1  [get_ports {i_data[89]}]
set_drive 1  [get_ports {i_data[88]}]
set_drive 1  [get_ports {i_data[87]}]
set_drive 1  [get_ports {i_data[86]}]
set_drive 1  [get_ports {i_data[85]}]
set_drive 1  [get_ports {i_data[84]}]
set_drive 1  [get_ports {i_data[83]}]
set_drive 1  [get_ports {i_data[82]}]
set_drive 1  [get_ports {i_data[81]}]
set_drive 1  [get_ports {i_data[80]}]
set_drive 1  [get_ports {i_data[79]}]
set_drive 1  [get_ports {i_data[78]}]
set_drive 1  [get_ports {i_data[77]}]
set_drive 1  [get_ports {i_data[76]}]
set_drive 1  [get_ports {i_data[75]}]
set_drive 1  [get_ports {i_data[74]}]
set_drive 1  [get_ports {i_data[73]}]
set_drive 1  [get_ports {i_data[72]}]
set_drive 1  [get_ports {i_data[71]}]
set_drive 1  [get_ports {i_data[70]}]
set_drive 1  [get_ports {i_data[69]}]
set_drive 1  [get_ports {i_data[68]}]
set_drive 1  [get_ports {i_data[67]}]
set_drive 1  [get_ports {i_data[66]}]
set_drive 1  [get_ports {i_data[65]}]
set_drive 1  [get_ports {i_data[64]}]
set_drive 1  [get_ports {i_data[63]}]
set_drive 1  [get_ports {i_data[62]}]
set_drive 1  [get_ports {i_data[61]}]
set_drive 1  [get_ports {i_data[60]}]
set_drive 1  [get_ports {i_data[59]}]
set_drive 1  [get_ports {i_data[58]}]
set_drive 1  [get_ports {i_data[57]}]
set_drive 1  [get_ports {i_data[56]}]
set_drive 1  [get_ports {i_data[55]}]
set_drive 1  [get_ports {i_data[54]}]
set_drive 1  [get_ports {i_data[53]}]
set_drive 1  [get_ports {i_data[52]}]
set_drive 1  [get_ports {i_data[51]}]
set_drive 1  [get_ports {i_data[50]}]
set_drive 1  [get_ports {i_data[49]}]
set_drive 1  [get_ports {i_data[48]}]
set_drive 1  [get_ports {i_data[47]}]
set_drive 1  [get_ports {i_data[46]}]
set_drive 1  [get_ports {i_data[45]}]
set_drive 1  [get_ports {i_data[44]}]
set_drive 1  [get_ports {i_data[43]}]
set_drive 1  [get_ports {i_data[42]}]
set_drive 1  [get_ports {i_data[41]}]
set_drive 1  [get_ports {i_data[40]}]
set_drive 1  [get_ports {i_data[39]}]
set_drive 1  [get_ports {i_data[38]}]
set_drive 1  [get_ports {i_data[37]}]
set_drive 1  [get_ports {i_data[36]}]
set_drive 1  [get_ports {i_data[35]}]
set_drive 1  [get_ports {i_data[34]}]
set_drive 1  [get_ports {i_data[33]}]
set_drive 1  [get_ports {i_data[32]}]
set_drive 1  [get_ports {i_data[31]}]
set_drive 1  [get_ports {i_data[30]}]
set_drive 1  [get_ports {i_data[29]}]
set_drive 1  [get_ports {i_data[28]}]
set_drive 1  [get_ports {i_data[27]}]
set_drive 1  [get_ports {i_data[26]}]
set_drive 1  [get_ports {i_data[25]}]
set_drive 1  [get_ports {i_data[24]}]
set_drive 1  [get_ports {i_data[23]}]
set_drive 1  [get_ports {i_data[22]}]
set_drive 1  [get_ports {i_data[21]}]
set_drive 1  [get_ports {i_data[20]}]
set_drive 1  [get_ports {i_data[19]}]
set_drive 1  [get_ports {i_data[18]}]
set_drive 1  [get_ports {i_data[17]}]
set_drive 1  [get_ports {i_data[16]}]
set_drive 1  [get_ports {i_data[15]}]
set_drive 1  [get_ports {i_data[14]}]
set_drive 1  [get_ports {i_data[13]}]
set_drive 1  [get_ports {i_data[12]}]
set_drive 1  [get_ports {i_data[11]}]
set_drive 1  [get_ports {i_data[10]}]
set_drive 1  [get_ports {i_data[9]}]
set_drive 1  [get_ports {i_data[8]}]
set_drive 1  [get_ports {i_data[7]}]
set_drive 1  [get_ports {i_data[6]}]
set_drive 1  [get_ports {i_data[5]}]
set_drive 1  [get_ports {i_data[4]}]
set_drive 1  [get_ports {i_data[3]}]
set_drive 1  [get_ports {i_data[2]}]
set_drive 1  [get_ports {i_data[1]}]
set_drive 1  [get_ports {i_data[0]}]
